In [7]:
import numpy as np
import pandas as pd
import os
import lxml

* **CSV** for comma separated values in a file

In [4]:
pd.read_csv('t.txt')

    name  age   city
0  Ankit   20   Pune
1  Rahul   22  Delhi

In [5]:
pwd

'd:\\Projects\\Python_for_ML\\pandas'

* can read the file also by using the entire path of the file

In [6]:
pd.read_csv("d:\\Projects\\Python_for_ML\\pandas\\t.txt")

    name  age   city
0  Ankit   20   Pune
1  Rahul   22  Delhi

In [10]:
a=pd.read_csv("d:\\Projects\\Python_for_ML\\pandas\\e.xlsx")

In [11]:
a

   ID   Name  Age  Course  Marks    City
0   1  Ankit   20  Python     85    Pune
1   2  Rahul   22    Java     78   Delhi
2   3   Neha   21      ML     92  Mumbai
3   4   Aman   23     C++     69  Jaipur
4   5  Pooja   20      DS     88  Indore

In [12]:
type(a)

pandas.DataFrame